/* 
  Localizable.strings
  RunCat

  Created by Takuto Nakamura on 2021/08/08.
  
*/

"support" = "支持\n";
"url" = "https://kyome.io/runcat/index.html";
"urlQueryLang" = "%@?lang=cn";
"urlQueryLangHelp" = "%@?lang=cn#self_made";
"urlQueryLangPlugins" = "%@?lang=cn#plugins";

// 邮箱
"issueReport" = "问题报告";
"environment" = "# 环境\n- %@: 版本 %@\n- macOS: %@\n";
"whatYouTried" = "# 你尝试过什么\n- 重新启动应用程序: 是/否\n- 在RunCat商店恢复购买: 是/否\n";
"shortDescription" = "# 简短描述\n\n";
"reproduceIssue" = "# 故障再现步骤\n\n";
"expectedResult" = "# 预期结果\n\n";

// 主要菜单
"systemInfo" = "系统信息";
"runner" = "皮肤";
"runnersStore" = "商店";
"preferences" = "偏好设置...";
"activityMonitor" = "打开活动监视器";
"aboutApp" = "关于RunCat";
"acknowledgments" = "致谢";
"reportIssue" = "报告问题";
"quitApp" = "退出RunCat";

// 系统信息
"temperature" = "温度: %4.1f°C";

// CPU
"cpu" = "CPU: %4.1f%%";
"system" = "系统: %4.1f%%";
"user" = "用户: %4.1f%%";
"idle" = "空闲: %4.1f%%";

// 内存
"memory" = "内存: %4.1f%%";
"pressure" = "压力: %4.1f%%";
"app" = "应用: %4.1f GB";
"wired" = "联动: %4.1f GB";
"compressed" = "压缩: %4.1f GB";

// 电池
"batteryIsNotInstalled" = "电池: 未安装";
"battery" = "容量: %5.1f%%";
"powerSource" = "电源: %@";
"health" = "状况: %5.1f%%";
"maxCapacity" = "最大容量: %5.1f%%";
"cycle" = "循环次数: %d";

// 硬盘
"disk" = "硬盘: %4.1f%% 占用";

// 网络
"network" = "网络: %@";
"noConnection" = "未连接";
"localIp" = "本地IP: %@";
"upload" = "上传: %@";
"download" = "下载: %@";
"unknown" = "未知";

// 自制
"selfMadeError" = "自制的RunCat错误";
"fileBroken" = "该RunCat的数据已损坏。请重新注册。";

// 停止RunCat
"stopRunnerMessage" = "你确实要停止RunCat吗？";
"stopRunnerInfo" = "如果停止运行程序，此应用程序的唯一性将丢失。";
"changedMyMind" = "我改变主意了";
"stop" = "停止RunCat";

// 商店和 IAP 通知
"storeOpenError" = "商店当前不可用";
"cannotPayment" = "无法付款";
"someTrouble" = "你的电脑可能没有连接到互联网，或者商店的服务器可能有问题";
"storeNotification" = "RunCat: RunCat商店";
"finishPurchase" = "购买完成";
"funTime" = "玩的开心！!";
"finishRestore" = "恢复完成";
"checkState" = "请检查购买状态。";
"failedRestore" = "恢复失败";
"failedPurchase" = "购买失败";
"neverPurchase" = "至少需要购买一件商品。";
"contactText" = "如需帮助，请通过 https://support.apple.com/apps/ 联系 App Store 支持。";

// 商店物品
"allRunnerDescription" = "不包括特殊颜色的RunCat。";
"colorDescription" = "特殊颜色: 作出贡献的开发者。";
"unlockedDescription" = "解锁自制跑者注册功能。";
"purchase" = "购买";
"purchased" = "已购买";
"restore" = "从购买历史中恢复";
"do" = "执行";

// 注册
"addImage" = "选择PNG文件。";
"registrationError" = "RunCat注册失败";
"addImage" = "你上传的文件 FILE_NAME 违反了规定。";
"over100" = "你不能上传超过100张图片。";
"nameConflict" = "这个名字已经被使用了。请使用另一个。";
"registerFailed" = "注册失败。";
"loadingImageError" = "图像加载错误";
"onlyPNG" = "你能使用的唯一文件格式是png。";
"lockSelfMadeError" = "注册功能已被锁定";
"mustBuy" = "请在RunCat商店购买自制RunCat。";

// 错误支持
"recommendMessage" = "目前启用了停止运行器的设置。";
"recommendInfo" = "如果这不是你的本意，请在首选项中禁用停止运行器的设置。我对这可能造成的任何不便表示歉意。";

// Runner Name
"cat"            = "Cat α";
"b.cat"          = "Cat β";
"c.cat"          = "Cat γ";
"tail.cat"       = "Cat Tail";
"cat.nyan.mock"  = "Mock Nyan Cat";
"parrot"         = "Parrot";
"human"          = "Human";
"up.push"        = "Push-Up";
"up.sit"         = "Sit-Up";
"duck.rubber"    = "Rubber Duck";
"city"           = "City";
"sausage"        = "Sausage";
"dots"           = "Dots";
"reactor"        = "Reactor";
"slime"          = "Slime";
"fishman"        = "Fish-Man";
"sheep"          = "Sheep";
"sushi.rotating" = "Rotating Sushi";
"people.party"   = "Party People";
"dogeza"         = "Japanese Apology";
    
"cheetah"       = "Cheetah";
"dog"           = "Dog";
"puppy"         = "Puppy";
"rabbit"        = "Rabbit";
"frog"          = "Frog";
"bird"          = "Bird";
"penguin"       = "Penguin";
"dolphin"       = "Dolphin";
"dragon"        = "Dragon";
"owl"           = "Owl";
"dinosaur"      = "Dinosaur";
"terrier"       = "Terrier";
"hedgehog"      = "Hedgehog";
"horse"         = "Horse";
"penguin2"      = "Penguin 2";
"wheel.hamster" = "Hamster Wheel";
"octopus"       = "Octopus";
"chameleon"     = "Chameleon";
"chicken"       = "Chicken";
"mouse"         = "Mouse";
"pig"           = "Pig";
"fox"           = "Fox";
"whale"         = "Whale";
"otter"         = "Otter";
"squirrel"      = "Squirrel";
"butterfly"     = "Butterfly";
"greyhound"     = "Greyhound";
"corgi.welsh"   = "Welsh Corgi";
    
"cogwheel"         = "Cogwheel";
"bonfire"          = "Bonfire";
"drop"             = "Drop";
"rocket"           = "Rocket";
"pendulum"         = "Pendulum";
"cradle"           = "Newton's Cradle";
"curve.sine"       = "Sine Curve";
"pulse"            = "Pulse";
"coffee"           = "Coffee";
"locomotive.steam" = "Steam Locomotive";
"drink.tapioca"    = "Tapioca Drink";
"frypan"           = "Frypan";
"factory"          = "Factory";
"engine"           = "Engine";
"earth"            = "Earth";

"sleigh.reindeer"   = "Reindeer & Sleigh";
"snowman"           = "Snowman";
"chime.wind"        = "Wind Chime";
"sparkler"          = "Sparkler";
"lantern.o.jack"    = "Jack O' Lantern";
"ghost"             = "Ghost";
"mochi"             = "Mochi";

"runners.all"       = "Unlock All Runners";
"cat.golden"        = "Golden Cat";
"cat.cluster.metal" = "Metal Cluster Cat";
"cat.flash"         = "Flash Cat";
"neko.maneki"       = "Maneki Neko";
"sushi"             = "Sushi";
"cat.gaming"        = "Gaming Cat";
"parrot.party"      = "Party Parrot";
"uhooi"             = "Uhooi";
"made.self"         = "Self-Made Runner";
